// Напишите программу, которая будет создавать копию заданного массива
// с помощью поэлементарного копирования
Console.Clear();
int[] a = {1, 2, 3, 4, 5};
int[] b = new int[a. Length]; // ввод нового элемента (массива)
for (int i = 0; i < b.Length; i++) // цикл копирования массива А
       b[i] = a [i];

b[0] = b[0] + 5; // строка проверка второго массива В.

Console.WriteLine(string.Join(", ", a));

Console.WriteLine(string.Join(", ", b));